# Ruby 陣列與範圍


# =======================================================

def block(num)
    puts "============================"
    puts "|         範例 #{num}            |"
    puts "============================"
end

# =======================================================
block(1)
# 建立陣列
# 使用 Array 類別

a = Array.new

# 使用中括號

b = []

list = [1, 2, 3, 4, 5, "aa"]

list2 = %w(ruby php python)

p list2

# =======================================================
block(2)
# 使用陣列
heroes = ['孫悟空', "魯夫", "佐助", "一拳超人"]

puts heroes[0]

# 使用負號 後面數過來
puts heroes[-1]


#  first  last 
puts "first : #{heroes.first}"
puts "last : #{heroes.last}"

puts "length : #{heroes.length}"

heroes << "鳴人"
heroes.push("布羅利")

# =======================================================
block(3)

# map 方法
# 對集合裡的每個元素進行運算 ,並收集成一個新的集合
# collect 同義詞

list3 = [1, 2, 3, 4, 5]

list4 = list3.map { |x| 
            x * 2
        }

puts list4

# =======================================================
block(4)

# map 方法2

p (1..10).map{ |i|
    i * 2
}


# =======================================================
block(5)

# select 方法
# 從集合裡挑選符合條件的元素
# 同義詞 : filter
# 反義詞 : reject

p (1..10).select{
    |x| x < 5
}
p (1..10).reject{
    |x| x < 5
} 

# =======================================================
block(6)

# ruduce 方法
# 從集合裡的每個元素進行運算, 並將所有的運算結果歸納成一個單一結果
# 同義詞 : inject

p (1..10).reduce{
    |sum, x| sum + x
}

#  陣列參考方法 
#  https://ruby-doc.org/core/Array.html

# =======================================================
block(7)

# 範圍 (.. and ...)

# 結果 1 ~ 10
puts (1..10).to_a 
# 結果 1 ~ 9
p (1...10).to_a
# 結果 a ~ z
p ('a'..'z').to_a

